sendu2wfdx/RemoteBSP/firmware/boards/stm32f103cbt6/main.c
#include "stm32f1xx_hal.h"

#include "remotebsp_embedded/board_config.h"
#if defined(CONFIG_REMOTEBSP_PWM) || defined(CONFIG_REMOTEBSP_TIMED_BITSTREAM)
#include "remotebsp_embedded/board_waveform.h"
#endif
#include "remotebsp_embedded/byte_ring.h"
#include "remotebsp_embedded/core.h"
#ifdef CONFIG_REMOTEBSP_SOFT_HALF_DUPLEX_UART
#include "remotebsp_embedded/soft_half_duplex_uart.h"
#endif
#include "remotebsp_embedded/startup_gpio.h"
#include <string.h>

#ifdef CONFIG_F103_CLOCK_HSE_8MHZ
#if CONFIG_SYSTEM_CLOCK_HZ != 72000000 || HSE_VALUE != 8000000U
#error "F103 外部时钟方案要求 8MHz HSE，并产生 72MHz SYSCLK"
#endif
#define F103_CAN_CLOCK_HZ 36000000U
#define F103_CAN_TIME_QUANTA 18U
#define F103_CAN_BS1 CAN_BS1_15TQ
#else
#if CONFIG_SYSTEM_CLOCK_HZ != 64000000 || HSI_VALUE != 8000000U
#error "F103 内部时钟方案要求 8MHz HSI，并产生 64MHz SYSCLK"
#endif
#define F103_CAN_CLOCK_HZ 32000000U
#define F103_CAN_TIME_QUANTA 16U
#define F103_CAN_BS1 CAN_BS1_13TQ
#endif

#if (F103_CAN_CLOCK_HZ % (CONFIG_CAN_NOMINAL_BITRATE * F103_CAN_TIME_QUANTA)) != 0
#error "当前 F103 CAN 位时序无法精确生成所选仲裁段波特率"
#endif

#define CAN_PRESCALER \
    (F103_CAN_CLOCK_HZ / (CONFIG_CAN_NOMINAL_BITRATE * F103_CAN_TIME_QUANTA))

#if CAN_PRESCALER < 1 || CAN_PRESCALER > 1024
#error "F103 CAN 分频系数超出硬件范围"
#endif

#if CONFIG_HARDWARE_UART_RESOURCE_COUNT > 0
#define RBSP_HARDWARE_UART_ENABLED 1
#endif

#ifdef RBSP_HARDWARE_UART_ENABLED
#if !defined(CONFIG_UART0_PINS_PA9_PA10) && \
    !defined(CONFIG_UART0_PINS_PB6_PB7)
#error "启用 F103 UART 时必须选择 USART1 引脚组"
#endif
#if CONFIG_UART_RX_BUFFER_SIZE < 2 || CONFIG_UART_TX_BUFFER_SIZE < 2
#error "UART 环形缓冲至少需要两个字节"
#endif
#endif

static CAN_HandleTypeDef can_handle;
static rbsp_core_t remote_core;

#ifdef CONFIG_REMOTEBSP_MOTION
#ifdef CONFIG_MOTION_SLOT0_ENABLED
#define MOTION_SLOT0_AXIS_COUNT 1U
#else
#define MOTION_SLOT0_AXIS_COUNT 0U
#endif
#ifdef CONFIG_MOTION_SLOT1_ENABLED
#define MOTION_SLOT1_AXIS_COUNT 1U
#else
#define MOTION_SLOT1_AXIS_COUNT 0U
#endif
#ifdef CONFIG_MOTION_SLOT2_ENABLED
#define MOTION_SLOT2_AXIS_COUNT 1U
#else
#define MOTION_SLOT2_AXIS_COUNT 0U
#endif
#ifdef CONFIG_MOTION_SLOT3_ENABLED
#define MOTION_SLOT3_AXIS_COUNT 1U
#else
#define MOTION_SLOT3_AXIS_COUNT 0U
#endif
#ifdef CONFIG_MOTION_SLOT4_ENABLED
#define MOTION_SLOT4_AXIS_COUNT 1U
#else
#define MOTION_SLOT4_AXIS_COUNT 0U
#endif

#define MOTION_SLOT_AXIS_COUNT \
    (MOTION_SLOT0_AXIS_COUNT + MOTION_SLOT1_AXIS_COUNT + \
     MOTION_SLOT2_AXIS_COUNT + MOTION_SLOT3_AXIS_COUNT + \
     MOTION_SLOT4_AXIS_COUNT)

#if MOTION_SLOT_AXIS_COUNT == 0U
#error "启用运动模块时至少要启用一个本板运动槽"
#endif
#if MOTION_SLOT_AXIS_COUNT > CONFIG_MOTION_MAX_AXES
#error "已启用的本板运动槽数量不能超过 MOTION_MAX_AXES"
#endif

typedef struct {
    uint8_t port;
    uint8_t pin;
} motion_pin_t;

typedef struct {
    motion_pin_t step;
    motion_pin_t direction;
    motion_pin_t enable;
    bool direction_inverted;
    bool enable_active_low;
} motion_axis_pins_t;

static const motion_axis_pins_t motion_axis_pins[MOTION_SLOT_AXIS_COUNT] = {
#ifdef CONFIG_MOTION_SLOT0_ENABLED
    {{CONFIG_MOTION_SLOT0_STEP_PIN / 16U, CONFIG_MOTION_SLOT0_STEP_PIN % 16U},
     {CONFIG_MOTION_SLOT0_DIR_PIN / 16U, CONFIG_MOTION_SLOT0_DIR_PIN % 16U},
     {CONFIG_MOTION_SLOT0_ENABLE_PIN / 16U, CONFIG_MOTION_SLOT0_ENABLE_PIN % 16U},
#ifdef CONFIG_MOTION_SLOT0_DIR_INVERTED
     true,
#else
     false,
#endif
#ifdef CONFIG_MOTION_SLOT0_ENABLE_ACTIVE_LOW
     true},
#else
     false},
#endif
#endif
#ifdef CONFIG_MOTION_SLOT1_ENABLED
    {{CONFIG_MOTION_SLOT1_STEP_PIN / 16U, CONFIG_MOTION_SLOT1_STEP_PIN % 16U},
     {CONFIG_MOTION_SLOT1_DIR_PIN / 16U, CONFIG_MOTION_SLOT1_DIR_PIN % 16U},
     {CONFIG_MOTION_SLOT1_ENABLE_PIN / 16U, CONFIG_MOTION_SLOT1_ENABLE_PIN % 16U},
#ifdef CONFIG_MOTION_SLOT1_DIR_INVERTED
     true,
#else
     false,
#endif
#ifdef CONFIG_MOTION_SLOT1_ENABLE_ACTIVE_LOW
     true},
#else
     false},
#endif
#endif
#ifdef CONFIG_MOTION_SLOT2_ENABLED
    {{CONFIG_MOTION_SLOT2_STEP_PIN / 16U, CONFIG_MOTION_SLOT2_STEP_PIN % 16U},
     {CONFIG_MOTION_SLOT2_DIR_PIN / 16U, CONFIG_MOTION_SLOT2_DIR_PIN % 16U},
     {CONFIG_MOTION_SLOT2_ENABLE_PIN / 16U, CONFIG_MOTION_SLOT2_ENABLE_PIN % 16U},
#ifdef CONFIG_MOTION_SLOT2_DIR_INVERTED
     true,
#else
     false,
#endif
#ifdef CONFIG_MOTION_SLOT2_ENABLE_ACTIVE_LOW
     true},
#else
     false},
#endif
#endif
#ifdef CONFIG_MOTION_SLOT3_ENABLED
    {{CONFIG_MOTION_SLOT3_STEP_PIN / 16U, CONFIG_MOTION_SLOT3_STEP_PIN % 16U},
     {CONFIG_MOTION_SLOT3_DIR_PIN / 16U, CONFIG_MOTION_SLOT3_DIR_PIN % 16U},
     {CONFIG_MOTION_SLOT3_ENABLE_PIN / 16U, CONFIG_MOTION_SLOT3_ENABLE_PIN % 16U},
#ifdef CONFIG_MOTION_SLOT3_DIR_INVERTED
     true,
#else
     false,
#endif
#ifdef CONFIG_MOTION_SLOT3_ENABLE_ACTIVE_LOW
     true},
#else
     false},
#endif
#endif
#ifdef CONFIG_MOTION_SLOT4_ENABLED
    {{CONFIG_MOTION_SLOT4_STEP_PIN / 16U, CONFIG_MOTION_SLOT4_STEP_PIN % 16U},
     {CONFIG_MOTION_SLOT4_DIR_PIN / 16U, CONFIG_MOTION_SLOT4_DIR_PIN % 16U},
     {CONFIG_MOTION_SLOT4_ENABLE_PIN / 16U, CONFIG_MOTION_SLOT4_ENABLE_PIN % 16U},
#ifdef CONFIG_MOTION_SLOT4_DIR_INVERTED
     true,
#else
     false,
#endif
#ifdef CONFIG_MOTION_SLOT4_ENABLE_ACTIVE_LOW
     true},
#else
     false},
#endif
#endif
};

static const uint16_t motion_enable_group_ids[MOTION_SLOT_AXIS_COUNT] = {
#ifdef CONFIG_MOTION_SLOT0_ENABLED
    CONFIG_MOTION_SLOT0_ENABLE_PIN,
#endif
#ifdef CONFIG_MOTION_SLOT1_ENABLED
    CONFIG_MOTION_SLOT1_ENABLE_PIN,
#endif
#ifdef CONFIG_MOTION_SLOT2_ENABLED
    CONFIG_MOTION_SLOT2_ENABLE_PIN,
#endif
#ifdef CONFIG_MOTION_SLOT3_ENABLED
    CONFIG_MOTION_SLOT3_ENABLE_PIN,
#endif
#ifdef CONFIG_MOTION_SLOT4_ENABLED
    CONFIG_MOTION_SLOT4_ENABLE_PIN,
#endif
};
static bool motion_enable_requests[MOTION_SLOT_AXIS_COUNT];

static volatile uint32_t motion_timebase_epochs;
#endif

#ifdef CONFIG_BOARD_WEACT_BLUEPILL_PLUS
#define WEACT_BUTTON_ENCODED_PIN 0U
#define WEACT_LED_ENCODED_PIN 18U
#endif

#ifdef RBSP_HARDWARE_UART_ENABLED
static UART_HandleTypeDef uart0_handle;
static rbsp_byte_ring_t uart0_rx_ring;
static rbsp_byte_ring_t uart0_tx_ring;
static uint8_t uart0_rx_storage[CONFIG_UART_RX_BUFFER_SIZE];
static uint8_t uart0_tx_storage[CONFIG_UART_TX_BUFFER_SIZE];
static volatile bool uart0_configured;
#endif

