sendu2wfdx/RemoteBSP/firmware/boards/stm32f103cbt6/main.c
/*
 * 实机联调诊断计数器。它们不参与协议，也不改变运行逻辑；调试器可以在
 * 系统运行时只读查看，用于区分物理接收、远程核心响应和发送失败。
 */
volatile uint32_t rbsp_diag_can_rx_frames;
volatile uint32_t rbsp_diag_can_tx_frames;
volatile uint32_t rbsp_diag_can_tx_failures;
volatile uint32_t rbsp_diag_can_rx_failures;
#ifdef RBSP_HARDWARE_UART_ENABLED
volatile uint32_t rbsp_diag_uart_rx_bytes;
volatile uint32_t rbsp_diag_uart_tx_bytes;
volatile uint32_t rbsp_diag_uart_rx_overflows;
volatile uint32_t rbsp_diag_uart_errors;
#endif

static void put_u32(uint8_t* output, uint32_t value) {
    output[0] = (uint8_t)value;
    output[1] = (uint8_t)(value >> 8U);
    output[2] = (uint8_t)(value >> 16U);
    output[3] = (uint8_t)(value >> 24U);
}

static void fatal_error(void) {
    __disable_irq();
    for (;;) {
    }
}

#ifdef CONFIG_APP_LAYOUT_KATAPULT_8K
static void board_enter_bootloader(rbsp_bootloader_mode_t mode) {
    static const uint64_t can_request_signature =
        UINT64_C(0x5984E3FA6CA1589B);
    static const uint64_t usb_request_signature =
        UINT64_C(0x8F3D6A21C457B09E);
    const uint64_t request_signature =
        mode == RBSP_BOOTLOADER_USB
            ? usb_request_signature : can_request_signature;
    const uint32_t signature_address =
        *(const volatile uint32_t*)FLASH_BASE;
    const uint32_t ram_begin = SRAM_BASE;
    const uint32_t ram_end = SRAM_BASE + (20U * 1024U);
    if ((signature_address & 7U) != 0U ||
        signature_address < ram_begin ||
        signature_address > ram_end - sizeof(request_signature)) {
        fatal_error();
    }
    __disable_irq();
    *(volatile uint64_t*)(uintptr_t)signature_address =
        request_signature;
    __DSB();
    __ISB();
    NVIC_SystemReset();
    for (;;) {
    }
}
#endif

static void system_clock_configure(void) {
    RCC_OscInitTypeDef oscillator = {0};
    RCC_ClkInitTypeDef clock = {0};

    /* 外部 8MHz 优先得到 72MHz；无 HSE 的通用板可退回 HSI/2×16=64MHz。 */
#ifdef CONFIG_F103_CLOCK_HSE_8MHZ
    oscillator.OscillatorType = RCC_OSCILLATORTYPE_HSE;
    oscillator.HSEState = RCC_HSE_ON;
    oscillator.HSEPredivValue = RCC_HSE_PREDIV_DIV1;
#else
    oscillator.OscillatorType = RCC_OSCILLATORTYPE_HSI;
    oscillator.HSIState = RCC_HSI_ON;
    oscillator.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
#endif
    oscillator.PLL.PLLState = RCC_PLL_ON;
#ifdef CONFIG_F103_CLOCK_HSE_8MHZ
    oscillator.PLL.PLLSource = RCC_PLLSOURCE_HSE;
    oscillator.PLL.PLLMUL = RCC_PLL_MUL9;
#else
    oscillator.PLL.PLLSource = RCC_PLLSOURCE_HSI_DIV2;
    oscillator.PLL.PLLMUL = RCC_PLL_MUL16;
#endif
    if (HAL_RCC_OscConfig(&oscillator) != HAL_OK) {
        fatal_error();
    }

    clock.ClockType = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK |
                      RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2;
    clock.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
    clock.AHBCLKDivider = RCC_SYSCLK_DIV1;
    clock.APB1CLKDivider = RCC_HCLK_DIV2;
    clock.APB2CLKDivider = RCC_HCLK_DIV1;
    if (HAL_RCC_ClockConfig(&clock, FLASH_LATENCY_2) != HAL_OK) {
        fatal_error();
    }

    /*
     * 时钟配置与 CAN 位时序不可分离。运行期再次核对，避免以后修改
     * 时钟源后仍生成一个“能启动但波特率错误”的固件。
     */
    SystemCoreClockUpdate();
    if (SystemCoreClock != CONFIG_SYSTEM_CLOCK_HZ ||
        HAL_RCC_GetPCLK1Freq() != F103_CAN_CLOCK_HZ) {
        fatal_error();
    }
}

static GPIO_TypeDef* gpio_port_from_index(uint8_t index) {
    switch (index) {
        case 0U:
            return GPIOA;
        case 1U:
            return GPIOB;
        case 2U:
            return GPIOC;
        case 3U:
            return GPIOD;
        default:
            return NULL;
    }
}

static void enable_gpio_clock(uint8_t index) {
    switch (index) {
        case 0U:
            __HAL_RCC_GPIOA_CLK_ENABLE();
            break;
        case 1U:
            __HAL_RCC_GPIOB_CLK_ENABLE();
            break;
        case 2U:
            __HAL_RCC_GPIOC_CLK_ENABLE();
            break;
        case 3U:
            __HAL_RCC_GPIOD_CLK_ENABLE();
            break;
        default:
            break;
    }
}

static bool gpio_pin_present(uint16_t encoded_pin) {
    const uint8_t port = (uint8_t)(encoded_pin / 16U);
    const uint8_t pin = (uint8_t)(encoded_pin % 16U);
    if (port > 3U) {
        return false;
    }
    /* LQFP48 上 GPIOC 仅引出 13..15，GPIOD 仅引出 0..1。 */
    if ((port == 2U && pin < 13U) ||
        (port == 3U && pin > 1U)) {
        return false;
    }
    /* PA13/PA14 永久保留给 SWD，CAN 引脚也不允许被远程重配置。 */
    if (port == 0U && (pin == 13U || pin == 14U)) {
        return false;
    }
#ifdef CONFIG_F103_CLOCK_HSE_8MHZ
    /* PD0/PD1 是 OSC_IN/OSC_OUT，外部高速晶振启用时不得复用。 */
    if (port == 3U && (pin == 0U || pin == 1U)) {
        return false;
    }
#endif
#ifdef CONFIG_BOARD_WEACT_BLUEPILL_PLUS
    /* 板载 USB 接口固定占用 PA11/PA12，不能作为远程 GPIO 重新配置。 */
    if (port == 0U && (pin == 11U || pin == 12U)) {
        return false;
    }
#endif
#ifdef CONFIG_BOARD_HAS_LSE_32768
    /* PC14/PC15 已连接 32.768kHz 晶振，留给未来 RTC/守时模块。 */
    if (port == 2U && (pin == 14U || pin == 15U)) {
        return false;
    }
#endif
#if defined(CONFIG_CAN_PINS_PA11_PA12)
    if (port == 0U && (pin == 11U || pin == 12U)) {
        return false;
    }
#else
    if (port == 1U && (pin == 8U || pin == 9U)) {
        return false;
    }
#endif
#ifdef RBSP_HARDWARE_UART_ENABLED
#if defined(CONFIG_UART0_PINS_PA9_PA10)
    if (port == 0U && (pin == 9U || pin == 10U)) {
        return false;
    }
#else
    if (port == 1U && (pin == 6U || pin == 7U)) {
        return false;
    }
#endif
#endif
#ifdef CONFIG_CAN_TRANSCEIVER_STB_ENABLE
    static const char stb_port[] = CONFIG_CAN_TRANSCEIVER_STB_PORT;
    const uint8_t stb_port_index =
        (uint8_t)(stb_port[0] - 'A');
    if (port == stb_port_index &&
        pin == CONFIG_CAN_TRANSCEIVER_STB_PIN) {
        return false;
    }
#endif
    return true;
}

#ifdef CONFIG_REMOTEBSP_SOFT_HALF_DUPLEX_UART
static bool soft_uart_pin_reserved(uint16_t encoded_pin);
static bool soft_uart_configuration_valid(bool used[64]);
#endif

#if defined(CONFIG_REMOTEBSP_MOTION) || \
    defined(CONFIG_REMOTEBSP_SOFT_HALF_DUPLEX_UART)
static bool motion_pin_reserved_by_board(uint16_t encoded_pin) {
#ifdef CONFIG_BOARD_WEACT_BLUEPILL_PLUS
    return encoded_pin == WEACT_BUTTON_ENCODED_PIN ||
           encoded_pin == WEACT_LED_ENCODED_PIN;
#else
    (void)encoded_pin;
    return false;
#endif
}
#endif

