sendu2wfdx/RemoteBSP/firmware/boards/stm32f103cbt6/main.c
static bool soft_uart_set_output(void* context, uint8_t port, bool high) {
    (void)context;
    GPIO_TypeDef* const gpio = soft_uart_gpio(port);
    const uint16_t mask = soft_uart_mask(port);
    if (gpio == NULL || mask == 0U) {
        return false;
    }
    if (high) {
        gpio->BSRR = mask;
    } else {
        gpio->BRR = mask;
    }
    GPIO_InitTypeDef init = {0};
    init.Pin = mask;
    init.Mode = GPIO_MODE_OUTPUT_PP;
    init.Pull = GPIO_NOPULL;
    init.Speed = GPIO_SPEED_FREQ_HIGH;
    HAL_GPIO_Init(gpio, &init);
    return true;
}

static bool soft_uart_read_input(void* context, uint8_t port, bool* high) {
    (void)context;
    GPIO_TypeDef* const gpio = soft_uart_gpio(port);
    const uint16_t mask = soft_uart_mask(port);
    if (gpio == NULL || mask == 0U || high == NULL) {
        return false;
    }
    *high = (gpio->IDR & mask) != 0U;
    return true;
}

static void soft_uart_delay_ticks(void* context, uint32_t ticks) {
    (void)context;
    const uint32_t started = DWT->CYCCNT;
    while ((uint32_t)(DWT->CYCCNT - started) < ticks) {
    }
}

static uint32_t soft_uart_irq_save_disable(void* context) {
    (void)context;
    const uint32_t state = __get_PRIMASK();
    __disable_irq();
    return state;
}

static void soft_uart_irq_restore(void* context, uint32_t state) {
    (void)context;
    if (state == 0U) {
        __enable_irq();
    }
}

static bool board_soft_uart_configure(uint8_t port, uint32_t baud,
                                      uint8_t bits, uint8_t stop,
                                      uint8_t parity) {
    return rbsp_soft_half_duplex_uart_configure(
        &soft_uart, port, baud, bits, stop, parity);
}

static size_t board_soft_uart_read(uint8_t port, uint8_t* data,
                                   size_t capacity) {
    return rbsp_soft_half_duplex_uart_read(&soft_uart, port, data, capacity);
}

static bool board_soft_uart_write(uint8_t port, const uint8_t* data,
                                  size_t length) {
#ifdef CONFIG_REMOTEBSP_MOTION
    if (remote_core.motion.state == RBSP_MOTION_ARMED ||
        remote_core.motion.state == RBSP_MOTION_RUNNING) {
        return false;
    }
#endif
    return rbsp_soft_half_duplex_uart_write(&soft_uart, port, data, length);
}
#endif

static void transceiver_enable(void) {
#ifdef CONFIG_CAN_TRANSCEIVER_STB_ENABLE
    static const char stb_port_name[] =
        CONFIG_CAN_TRANSCEIVER_STB_PORT;
    if (stb_port_name[0] < 'A' || stb_port_name[0] > 'D' ||
        CONFIG_CAN_TRANSCEIVER_STB_PIN > 15) {
        fatal_error();
    }
    const uint8_t port_index =
        (uint8_t)(stb_port_name[0] - 'A');
    GPIO_TypeDef* port = gpio_port_from_index(port_index);
    enable_gpio_clock(port_index);
    HAL_GPIO_WritePin(
        port, (uint16_t)(1U << CONFIG_CAN_TRANSCEIVER_STB_PIN),
        GPIO_PIN_RESET);
    GPIO_InitTypeDef init = {0};
    init.Pin = (uint16_t)(1U << CONFIG_CAN_TRANSCEIVER_STB_PIN);
    init.Mode = GPIO_MODE_OUTPUT_PP;
    init.Pull = GPIO_NOPULL;
    init.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(port, &init);
#endif
}

static bool board_startup_gpio_apply(
    uint16_t encoded_pin, rbsp_startup_gpio_mode_t mode) {
    if (!gpio_pin_allowed(encoded_pin)) {
        return false;
    }
    const uint8_t port_index = (uint8_t)(encoded_pin / 16U);
    const uint8_t pin_index = (uint8_t)(encoded_pin % 16U);
    GPIO_TypeDef* port = gpio_port_from_index(port_index);
    enable_gpio_clock(port_index);
    const bool output = mode == RBSP_STARTUP_GPIO_OUTPUT_LOW ||
                        mode == RBSP_STARTUP_GPIO_OUTPUT_HIGH;
    if (output) {
        HAL_GPIO_WritePin(
            port, (uint16_t)(1U << pin_index),
            mode == RBSP_STARTUP_GPIO_OUTPUT_HIGH
                ? GPIO_PIN_SET
                : GPIO_PIN_RESET);
    }
    GPIO_InitTypeDef init = {0};
    init.Pin = (uint16_t)(1U << pin_index);
    init.Mode = output ? GPIO_MODE_OUTPUT_PP : GPIO_MODE_INPUT;
    init.Pull = GPIO_NOPULL;
    if (mode == RBSP_STARTUP_GPIO_INPUT_PULLUP) {
        init.Pull = GPIO_PULLUP;
    } else if (mode == RBSP_STARTUP_GPIO_INPUT_PULLDOWN) {
        init.Pull = GPIO_PULLDOWN;
    } else if (!output && mode != RBSP_STARTUP_GPIO_INPUT_FLOATING) {
        return false;
    }
    init.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(port, &init);
    return true;
}

static void startup_gpio_configure(void) {
    if (!rbsp_startup_gpio_apply(
            CONFIG_STARTUP_GPIO_OUTPUT_LOW,
            CONFIG_STARTUP_GPIO_OUTPUT_HIGH,
            CONFIG_STARTUP_GPIO_INPUT_FLOATING,
            CONFIG_STARTUP_GPIO_INPUT_PULLUP,
            CONFIG_STARTUP_GPIO_INPUT_PULLDOWN,
            board_startup_gpio_apply)) {
        fatal_error();
    }
}

static bool board_gpio_configure(uint16_t encoded_pin,
                                 rbsp_gpio_direction_t direction,
                                 bool initial_value) {
    if (!gpio_pin_allowed(encoded_pin)) {
        return false;
    }
#ifdef CONFIG_BOARD_WEACT_BLUEPILL_PLUS
    if ((encoded_pin == WEACT_BUTTON_ENCODED_PIN &&
         direction != RBSP_GPIO_INPUT) ||
        (encoded_pin == WEACT_LED_ENCODED_PIN &&
         direction != RBSP_GPIO_OUTPUT)) {
        return false;
    }
#endif
    const uint8_t port_index = (uint8_t)(encoded_pin / 16U);
    const uint8_t pin_index = (uint8_t)(encoded_pin % 16U);
    GPIO_TypeDef* port = gpio_port_from_index(port_index);
    enable_gpio_clock(port_index);

    if (direction == RBSP_GPIO_OUTPUT) {
        HAL_GPIO_WritePin(port, (uint16_t)(1U << pin_index),
                          initial_value ? GPIO_PIN_SET : GPIO_PIN_RESET);
    }
    GPIO_InitTypeDef init = {0};
    init.Pin = (uint16_t)(1U << pin_index);
    init.Mode = direction == RBSP_GPIO_OUTPUT
                    ? GPIO_MODE_OUTPUT_PP
                    : GPIO_MODE_INPUT;
    init.Pull = GPIO_NOPULL;
#ifdef CONFIG_BOARD_WEACT_BLUEPILL_PLUS
    if (encoded_pin == WEACT_BUTTON_ENCODED_PIN) {
        init.Pull = GPIO_PULLDOWN;
    }
#endif
    init.Speed = GPIO_SPEED_FREQ_HIGH;
    HAL_GPIO_Init(port, &init);
    return true;
}

