sendu2wfdx/RemoteBSP/firmware/boards/stm32f103cbt6/main.c
static bool board_gpio_write(uint16_t encoded_pin, bool value) {
    if (!gpio_pin_allowed(encoded_pin)) {
        return false;
    }
#ifdef CONFIG_BOARD_WEACT_BLUEPILL_PLUS
    if (encoded_pin == WEACT_BUTTON_ENCODED_PIN) {
        return false;
    }
#endif
    GPIO_TypeDef* port =
        gpio_port_from_index((uint8_t)(encoded_pin / 16U));
    HAL_GPIO_WritePin(
        port, (uint16_t)(1U << (encoded_pin % 16U)),
        value ? GPIO_PIN_SET : GPIO_PIN_RESET);
    return true;
}

static bool board_gpio_read(uint16_t encoded_pin, bool* value) {
    if (!gpio_pin_allowed(encoded_pin) || value == NULL) {
        return false;
    }
    GPIO_TypeDef* port =
        gpio_port_from_index((uint8_t)(encoded_pin / 16U));
    *value = HAL_GPIO_ReadPin(
                 port, (uint16_t)(1U << (encoded_pin % 16U))) ==
             GPIO_PIN_SET;
    return true;
}

#ifdef CONFIG_BOARD_WEACT_BLUEPILL_PLUS
static void board_fixed_io_configure(void) {
    __HAL_RCC_GPIOA_CLK_ENABLE();
    __HAL_RCC_GPIOB_CLK_ENABLE();

    /*
     * BluePill Plus 的 USB D+ 带硬件上拉。CAN APP 不运行 USB 协议栈时主动
     * 拉低 PA12，向主机表示 USB 已断开，避免出现“设备描述符请求失败”。
     * 进入 Katapult 会先复位 MCU，PA12 随后由 USB Bootloader 重新配置。
     */
#if defined(CONFIG_CAN_PINS_PB8_PB9)
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_12, GPIO_PIN_RESET);
    GPIO_InitTypeDef usb_disconnect = {0};
    usb_disconnect.Pin = GPIO_PIN_12;
    usb_disconnect.Mode = GPIO_MODE_OUTPUT_PP;
    usb_disconnect.Pull = GPIO_NOPULL;
    usb_disconnect.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(GPIOA, &usb_disconnect);
#endif

    GPIO_InitTypeDef button = {0};
    button.Pin = GPIO_PIN_0;
    button.Mode = GPIO_MODE_INPUT;
    button.Pull = GPIO_PULLDOWN;
    HAL_GPIO_Init(GPIOA, &button);

    HAL_GPIO_WritePin(GPIOB, GPIO_PIN_2, GPIO_PIN_RESET);
    GPIO_InitTypeDef led = {0};
    led.Pin = GPIO_PIN_2;
    led.Mode = GPIO_MODE_OUTPUT_PP;
    led.Pull = GPIO_NOPULL;
    led.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(GPIOB, &led);
}

#ifdef CONFIG_WEACT_BLUEPILL_PLUS_PB2_BREATHING_LED
static void board_breathing_led_poll(void) {
    enum {
        /* PB2 没有可直接使用的硬件 PWM 通道，使用 100Hz、十级软件 PWM。 */
        BREATH_PWM_PERIOD_MS = 10U,
        BREATH_PERIOD_MS = 4000U,
        BREATH_HALF_PERIOD_MS = BREATH_PERIOD_MS / 2U,
    };

    static uint32_t last_tick = 0xFFFFFFFFU;
    const uint32_t now = HAL_GetTick();
    if (now == last_tick) {
        return;
    }
    last_tick = now;
    const uint32_t phase = now % BREATH_PERIOD_MS;
    const uint32_t ramp = phase < BREATH_HALF_PERIOD_MS
                              ? phase
                              : BREATH_PERIOD_MS - phase;
    const uint32_t duty_steps = (ramp * BREATH_PWM_PERIOD_MS) /
                                BREATH_HALF_PERIOD_MS;
    const uint32_t carrier = now % BREATH_PWM_PERIOD_MS;
    HAL_GPIO_WritePin(GPIOB, GPIO_PIN_2,
                      carrier < duty_steps ? GPIO_PIN_SET : GPIO_PIN_RESET);
}
#else
static void board_breathing_led_poll(void) {
}
#endif
#endif

void HAL_CAN_MspInit(CAN_HandleTypeDef* handle) {
    if (handle->Instance != CAN1) {
        return;
    }
    __HAL_RCC_CAN1_CLK_ENABLE();
    __HAL_RCC_AFIO_CLK_ENABLE();

    GPIO_InitTypeDef init = {0};
#if defined(CONFIG_CAN_PINS_PA11_PA12)
    __HAL_RCC_GPIOA_CLK_ENABLE();
    init.Pin = GPIO_PIN_11;
    init.Mode = GPIO_MODE_INPUT;
    init.Pull = GPIO_NOPULL;
    HAL_GPIO_Init(GPIOA, &init);
    init.Pin = GPIO_PIN_12;
    init.Mode = GPIO_MODE_AF_PP;
    init.Speed = GPIO_SPEED_FREQ_HIGH;
    HAL_GPIO_Init(GPIOA, &init);
#else
    __HAL_RCC_GPIOB_CLK_ENABLE();
    __HAL_AFIO_REMAP_CAN1_2();
    init.Pin = GPIO_PIN_8;
    init.Mode = GPIO_MODE_INPUT;
    init.Pull = GPIO_NOPULL;
    HAL_GPIO_Init(GPIOB, &init);
    init.Pin = GPIO_PIN_9;
    init.Mode = GPIO_MODE_AF_PP;
    init.Speed = GPIO_SPEED_FREQ_HIGH;
    HAL_GPIO_Init(GPIOB, &init);
#endif
}

#ifdef RBSP_HARDWARE_UART_ENABLED
void HAL_UART_MspInit(UART_HandleTypeDef* handle) {
    if (handle->Instance != USART1) {
        return;
    }
    __HAL_RCC_USART1_CLK_ENABLE();
    __HAL_RCC_AFIO_CLK_ENABLE();

    GPIO_InitTypeDef init = {0};
#if defined(CONFIG_UART0_PINS_PA9_PA10)
    __HAL_RCC_GPIOA_CLK_ENABLE();
    init.Pin = GPIO_PIN_9;
    init.Mode = GPIO_MODE_AF_PP;
    init.Speed = GPIO_SPEED_FREQ_HIGH;
    HAL_GPIO_Init(GPIOA, &init);
    init.Pin = GPIO_PIN_10;
    init.Mode = GPIO_MODE_INPUT;
    init.Pull = GPIO_PULLUP;
    HAL_GPIO_Init(GPIOA, &init);
#else
    __HAL_RCC_GPIOB_CLK_ENABLE();
    __HAL_AFIO_REMAP_USART1_ENABLE();
    init.Pin = GPIO_PIN_6;
    init.Mode = GPIO_MODE_AF_PP;
    init.Speed = GPIO_SPEED_FREQ_HIGH;
    HAL_GPIO_Init(GPIOB, &init);
    init.Pin = GPIO_PIN_7;
    init.Mode = GPIO_MODE_INPUT;
    init.Pull = GPIO_PULLUP;
    HAL_GPIO_Init(GPIOB, &init);
#endif
}

static bool board_hardware_uart_configure(uint8_t port, uint32_t baud_rate,
                                          uint8_t data_bits,
                                          uint8_t stop_bits,
                                          uint8_t parity) {
    if (port != 0U || baud_rate < 300U || baud_rate > 4500000U ||
        stop_bits < 1U || stop_bits > 2U || parity > 2U) {
        return false;
    }

    uint32_t word_length;
    if (parity == 0U && data_bits == 8U) {
        word_length = UART_WORDLENGTH_8B;
    } else if (parity != 0U && data_bits == 7U) {
        /* F1 的字长包含校验位：7 数据位 + 1 校验位。 */
        word_length = UART_WORDLENGTH_8B;
    } else if (parity != 0U && data_bits == 8U) {
        /* F1 的字长包含校验位：8 数据位 + 1 校验位。 */
        word_length = UART_WORDLENGTH_9B;
    } else {
        return false;
    }

    HAL_NVIC_DisableIRQ(USART1_IRQn);
    uart0_configured = false;
    if (uart0_handle.Instance == USART1) {
        (void)HAL_UART_DeInit(&uart0_handle);
    }
    rbsp_byte_ring_clear(&uart0_rx_ring);
    rbsp_byte_ring_clear(&uart0_tx_ring);

    uart0_handle.Instance = USART1;
    uart0_handle.Init.BaudRate = baud_rate;
    uart0_handle.Init.WordLength = word_length;
    uart0_handle.Init.StopBits =
        stop_bits == 1U ? UART_STOPBITS_1 : UART_STOPBITS_2;
    uart0_handle.Init.Parity =
        parity == 0U ? UART_PARITY_NONE
                     : (parity == 1U ? UART_PARITY_ODD
                                     : UART_PARITY_EVEN);
    uart0_handle.Init.Mode = UART_MODE_TX_RX;
    uart0_handle.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    uart0_handle.Init.OverSampling = UART_OVERSAMPLING_16;
    if (HAL_UART_Init(&uart0_handle) != HAL_OK) {
        return false;
    }

