sendu2wfdx/RemoteBSP/firmware/boards/stm32f103cbt6/main.c
    __HAL_UART_CLEAR_OREFLAG(&uart0_handle);
    __HAL_UART_ENABLE_IT(&uart0_handle, UART_IT_RXNE);
    __HAL_UART_ENABLE_IT(&uart0_handle, UART_IT_ERR);
    uart0_configured = true;
    HAL_NVIC_SetPriority(USART1_IRQn, 1U, 0U);
    HAL_NVIC_EnableIRQ(USART1_IRQn);
    return true;
}

static size_t board_hardware_uart_read(uint8_t port, uint8_t* data,
                                       size_t capacity) {
    if (port != 0U || !uart0_configured || data == NULL) {
        return 0U;
    }
    const uint32_t interrupt_state = __get_PRIMASK();
    __disable_irq();
    const size_t count =
        rbsp_byte_ring_read(&uart0_rx_ring, data, capacity);
    if (interrupt_state == 0U) {
        __enable_irq();
    }
    return count;
}

static bool board_hardware_uart_write(uint8_t port, const uint8_t* data,
                                      size_t length) {
    if (port != 0U || !uart0_configured || data == NULL ||
        length == 0U) {
        return false;
    }
    const uint32_t interrupt_state = __get_PRIMASK();
    __disable_irq();
    const bool accepted =
        rbsp_byte_ring_write_exact(&uart0_tx_ring, data, length);
    if (accepted) {
        __HAL_UART_ENABLE_IT(&uart0_handle, UART_IT_TXE);
    }
    if (interrupt_state == 0U) {
        __enable_irq();
    }
    return accepted;
}
#endif

#if CONFIG_UART_RESOURCE_COUNT > 0
static bool board_uart_configure(uint8_t port, uint32_t baud_rate,
                                 uint8_t data_bits, uint8_t stop_bits,
                                 uint8_t parity) {
#ifdef RBSP_HARDWARE_UART_ENABLED
    if (port < CONFIG_HARDWARE_UART_RESOURCE_COUNT) {
        return board_hardware_uart_configure(
            port, baud_rate, data_bits, stop_bits, parity);
    }
#endif
#ifdef CONFIG_REMOTEBSP_SOFT_HALF_DUPLEX_UART
    return board_soft_uart_configure(
        (uint8_t)(port - CONFIG_TMC2209_UART_OBJECT_BASE),
        baud_rate, data_bits, stop_bits, parity);
#endif
    return false;
}

static size_t board_uart_read(uint8_t port, uint8_t* data,
                              size_t capacity) {
#ifdef RBSP_HARDWARE_UART_ENABLED
    if (port < CONFIG_HARDWARE_UART_RESOURCE_COUNT) {
        return board_hardware_uart_read(port, data, capacity);
    }
#endif
#ifdef CONFIG_REMOTEBSP_SOFT_HALF_DUPLEX_UART
    return board_soft_uart_read(
        (uint8_t)(port - CONFIG_TMC2209_UART_OBJECT_BASE),
        data, capacity);
#endif
    return 0U;
}

static bool board_uart_write(uint8_t port, const uint8_t* data,
                             size_t length) {
#ifdef RBSP_HARDWARE_UART_ENABLED
    if (port < CONFIG_HARDWARE_UART_RESOURCE_COUNT) {
        return board_hardware_uart_write(port, data, length);
    }
#endif
#ifdef CONFIG_REMOTEBSP_SOFT_HALF_DUPLEX_UART
    return board_soft_uart_write(
        (uint8_t)(port - CONFIG_TMC2209_UART_OBJECT_BASE),
        data, length);
#endif
    return false;
}
#endif

#ifdef CONFIG_REMOTEBSP_MOTION
static void motion_write_pin(motion_pin_t pin, bool high) {
    GPIO_TypeDef* const gpio = gpio_port_from_index(pin.port);
    const uint16_t mask = (uint16_t)(1U << pin.pin);
    if (high) {
        gpio->BSRR = mask;
    } else {
        gpio->BRR = mask;
    }
}

static void motion_configure_output(motion_pin_t pin, bool initial_high) {
    GPIO_TypeDef* const gpio = gpio_port_from_index(pin.port);
    const uint16_t mask = (uint16_t)(1U << pin.pin);
    enable_gpio_clock(pin.port);
    motion_write_pin(pin, initial_high);
    GPIO_InitTypeDef init = {0};
    init.Pin = mask;
    init.Mode = GPIO_MODE_OUTPUT_PP;
    init.Pull = GPIO_NOPULL;
    init.Speed = GPIO_SPEED_FREQ_HIGH;
    HAL_GPIO_Init(gpio, &init);
}

/* 上电先关闭每一路 EN，再把 STEP 固定为低，避免初始化期间误动作。 */
static void motion_outputs_configure(void) {
    for (uint8_t axis = 0U; axis < MOTION_SLOT_AXIS_COUNT; ++axis) {
        const motion_axis_pins_t* const pins = &motion_axis_pins[axis];
        motion_configure_output(pins->enable, pins->enable_active_low);
        motion_configure_output(pins->step, false);
        motion_configure_output(pins->direction,
                                pins->direction_inverted);
    }
}

static bool board_motion_set_enable(uint8_t axis, bool enabled) {
    if (axis >= MOTION_SLOT_AXIS_COUNT) {
        return false;
    }
    const motion_axis_pins_t* const pins = &motion_axis_pins[axis];
    bool group_enabled = false;
    if (!rbsp_motion_shared_enable_update(
            motion_enable_group_ids, motion_enable_requests,
            MOTION_SLOT_AXIS_COUNT, axis, enabled, &group_enabled)) {
        return false;
    }
    motion_write_pin(pins->enable,
                     group_enabled != pins->enable_active_low);
    return true;
}

static bool board_motion_set_direction(uint8_t axis, bool positive) {
    if (axis >= MOTION_SLOT_AXIS_COUNT) {
        return false;
    }
    const motion_axis_pins_t* const pins = &motion_axis_pins[axis];
    motion_write_pin(pins->direction,
                     positive != pins->direction_inverted);
    return true;
}

static bool board_motion_set_step(uint8_t axis, bool high) {
    if (axis >= MOTION_SLOT_AXIS_COUNT) {
        return false;
    }
    motion_write_pin(motion_axis_pins[axis].step, high);
    return true;
}

/* TIM2 以 1MHz 自由运行，结合溢出中断构成单调的 64 位运动时钟。 */
static void motion_timebase_configure(void) {
    __HAL_RCC_TIM2_CLK_ENABLE();
    TIM2->CR1 = 0U;
    TIM2->PSC = 71U;
    TIM2->ARR = UINT32_MAX;
    TIM2->EGR = TIM_EGR_UG;
    TIM2->CNT = 0U;
    TIM2->SR = 0U;
    TIM2->DIER = TIM_DIER_UIE;
    motion_timebase_epochs = 0U;
    HAL_NVIC_SetPriority(TIM2_IRQn, 0U, 0U);
    HAL_NVIC_EnableIRQ(TIM2_IRQn);
    TIM2->CR1 = TIM_CR1_CEN;
}

static uint64_t board_motion_nanoseconds(void) {
    uint32_t before;
    uint32_t after;
    uint32_t counter;
    do {
        before = motion_timebase_epochs;
        counter = TIM2->CNT;
        after = motion_timebase_epochs;
    } while (before != after);
    if ((TIM2->SR & TIM_SR_UIF) != 0U &&
        counter < UINT32_C(0x80000000)) {
        ++after;
    }
    return (((uint64_t)after << 32U) | counter) * 1000ULL;
}

/* TIM2_CH1 只在下一条运动边沿到期时触发，不再占用周期定时器。 */
static bool motion_schedule_compare(uint64_t deadline_ns) {
    uint64_t deadline_us = deadline_ns / 1000ULL;
    if ((deadline_ns % 1000ULL) != 0U && deadline_us != UINT64_MAX) {
        ++deadline_us;
    }
    const uint64_t now_us = board_motion_nanoseconds() / 1000ULL;
    uint64_t delta_us = deadline_us > now_us
                            ? deadline_us - now_us
                            : 0U;
    if (delta_us < CONFIG_MOTION_COMPARE_MIN_LEAD_US) {
        delta_us = CONFIG_MOTION_COMPARE_MIN_LEAD_US;
    }
    if (delta_us > INT32_MAX) {
        delta_us = INT32_MAX;
    }

    TIM2->DIER &= ~TIM_DIER_CC1IE;
    uint32_t target = TIM2->CNT + (uint32_t)delta_us;
    TIM2->CCR1 = target;
    TIM2->SR = ~TIM_SR_CC1IF;
    if ((int32_t)(target - TIM2->CNT) <
        (int32_t)CONFIG_MOTION_COMPARE_MIN_LEAD_US) {
        target = TIM2->CNT + CONFIG_MOTION_COMPARE_MIN_LEAD_US;
        TIM2->CCR1 = target;
        TIM2->SR = ~TIM_SR_CC1IF;
    }
    TIM2->DIER |= TIM_DIER_CC1IE;
    return true;
}

